""" მომხარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ, რამდენჯერ შედის შემოტანილი 
რიცხვი 100-ში. გააკეთეთ ყველაზე მოკლე გზით(ამისათვის გამოიყენეთ გაყოფის სწორი ტიპი)"""

# num = int(input("გთხოვთ შეიტანოთ რიცხვი: "))
# result = 100 // num
# print(f"{num} შედის 100-ში {result} ჯერ.")

"""while ციკლის გამოყენებით გამოიტანეთ 1-დან 20-მდე ყველა კენტი რიცხვის ჯამი"""

# total_sum = 0

# n = 1
# while n <= 20:
#     if n % 2 != 0:  
#         total_sum += n  
#     n += 1  

# print("1-დან 20-მდე ყველა კენტის რიცხვის ჯამი:", total_sum)


"""მომხარებელს შემოატანინეთ ორი რიცხვი და დაბეჭდეთ ის, რომელიც არის მეტი.
თუ ორივე რიცხვი ტოლია დაბეჭდეთ "Both numbers are equal" """

# num1 = int(input("please enter firs number: "))
# num2 = int(input("please enter second number: "))

# if num1 > num2:
#     print(f"{num1} არის მეტი")
# elif num1 < num2:
#     print(f"{num2} მეტია")
# else: 
#     print("Both numbers are equal")

"""მომხარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ შემოტანილი რიცხვის ფაქტორიალი
(დასერჩეთ რა არის ფაქტორიალი)"""

# num = int(input("გთხოვთ შეიტანოთ რიცხვი: "))

# factorial = 1
# while num > 1:
#     factorial *= num  
#     num -= 1 

# print("ფაქტორიალი არის:", factorial)

"""მომხარებელს შემოატანინეთ რიცხვი და შეინახეთ ის ცვლადში. შემდეგ დაბეჭდეთ შემოტანილი
 რიცხვის ჩათვლით ყველა რიცხვის კვადრატის ჯამი"""


# num = int(input("გთხოვთ შეიტანოთ რიცხვი: "))

# total_sum = 0

# for i in range(1, num + 1):
#     total_sum += i * i  

# print(f"რიცხვების 1-დან {num}-მდე ყველა რიცხვის კვადრატის ჯამი არის: {total_sum}")


"""თამაში "რიცხვის გამოცნობა". შექმენით ცვლადი და შეინახეთ რომელიმე რიცხვი 1-დან 
20-ის ჩათვლით(ეს იქნება ჩაფიქრებული რიცხვი). გამოიყენეთ while loop-ი და მომხარებელს 
შემოატანინეთ რიცხვი იქამდე სანამ არ გამოიცნობს მას. თუ მომხარებლის მიერ შემოტანილი 
რიცხვი მეტია ჩაფიქრებულზე, დაპრინტეთ To high, თუ ნაკლებია Too low, ხოლო იმ
შემთხვევაში თუ მომხარებელი გამოიცნობს რიცხვს დაპრინტეთ "You win" """


# secret_number = 15

# while True:

#     guess = int(input("გამოიცანი რიცხვი 1-დან 20-მდე: "))

#     if guess > secret_number:
#         print("Too high!")  
#     elif guess < secret_number:
#         print("Too low!")  
#     else:
#         print("You win!")  
#         break 






























































































