"""მოხარებელს შეეკითხეთ მისი სახელი,გვარი ასაკი და იმეილი, შემდეგ კი შემოტანილი
 მნიშვნელობები დაბეჭდეთ ტერმინალში. გამოიყენეთ ეტიკეტი, რომ მიანიშნოთ მომხარებელს 
 თუ რა უნდა შემოიტანოს კონკრეტულ შესაყვან ველში."""

# first_name = input("გთხოვთ, შეიტანეთ თქვენი სახელი: ")  
# last_name = input("გთხოვთ, შეიტანეთ თქვენი გვარი: ")    
# age = input("გთხოვთ, შეიტანეთ თქვენი ასაკი: ")         
# email = input("გთხოვთ, შეიტანეთ თქვენი იმეილი: ")     

# print("\nმომხმარებლის მონაცემები:")
# print(f"სახელი:, {first_name}")
# print(f"გვარი:, {last_name}")
# print(f"ასაკი:, {age}")
# print(f"იმეილი:, {email}")

""" მომხარებელს შემოატანინეთ ორი რიცხვი და გამოიყენეთ ყველა არითმეტიკული ოპერაცია
 ამ ორ რიცხვს შორის."""

# num1 = int(input("გთხოვთ, შეიტანეთ პირველი რიცხვი: "))  
# num2 = int(input("გთხოვთ, შეიტანეთ მეორე რიცხვი: ")) 

# sum_result = num1 + num2      
# diff_result = num1 - num2    
# prod_result = num1 * num2     
# quot_result = num1 / num2     
# mod_result = num1 % num2     
# exp_result = num1 ** num2    

# print("\nარითმეტიკული ოპერაციების შედეგები:")
# print(f"{num1} + {num2} = {sum_result}")
# print(f"{num1} - {num2} = {diff_result}")
# print(f"{num1} * {num2} = {prod_result}")
# print(f"{num1} / {num2} = {quot_result}")
# print(f"{num1} % {num2} = {mod_result}")
# print(f"{num1} ** {num2} = {exp_result}")



""" კომენტარებით ახსენით თუ რა არის input-ი და output-ი, ასევე რისთვის გამოიყენება ისინი"""

# input() — გამოიყენება მონაცემების შესაყვანად, სადაც მომხმარებელი აკრეფს ინფორმაციას.
# print() — გამოიყენება მონაცემების გამოსაცემად, რაც ეკრანზე გამოჩენა.


"""შექმენით კალკულატორის პროგრამა სადაც მომხარებელი შემოიტანს ორ რიცხვს და 4
 არითმეტიკული ოპერაციიდან ერთერთს. შეასრულეთ ამ ორ რიცხვს შორის არჩეული 
  არითმეტიკული ოპერაცია"""

# num1 = int(input("შეიტანეთ პირველი რიცხვი: "))
# num2 = ~int(input("შეიტანეთ მეორე რიცხვი: "))
# operation = input("აირჩიეთ ოპერაცია (+, -, *, /): ")

# print(eval(f"{num1} {operation} {num2}"))
