"""დაითვალეთ რამდენი ლუწი რიცხვია 1-დან 50-ის ჩათვლით(გამოიყენეთ for loop-ი)"""

# even_count = 0

# for i in range(1, 51):
#     if i % 2 == 0:  
#         even_count += 1
# print(f"1-დან 50-მდე {even_count} ლუწი რიცხვია.")

"""დაბეჭდეთ 1-დან 100-მდე ყველა ლუწი რიცხვის საშუალო არითმეტიკული. გამოიყენეთ
while loop-ი.(დაგჭირდებათ ორი ცვლადის შექმნა, ერთში შეინახავთ ჯამს, მეორეში რაოდენობას)"""

# total_sum = 0
# count = 0

# num = 1
# while num <= 100:
#     if num % 2 == 0:  
#         total_sum += num  
#         count += 1 
#     num += 1  

# average = total_sum / count if count > 0 else 0

# print(f"1-დან 100-მდე ლუწი რიცხვების საშუალო არითმეტიკული არის: {average}")



""" დაბეჭდეთ ყველა რიცხვი 1-დან 30-მდე, რომელიც იყოფა 3-ზე(გამოიყენეთ while loop-ი)"""

# num = 1
# while num <= 30:
#     if num % 3 == 0: 
#         print(num)  
#     num += 1 

"""მომხარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ მიღებული რიცხვის ყველა
 გამყოფი(გამოიყენეთ for loop-ი)"""

# num = int(input("გთხოვთ შეიტანოთ რიცხვი: "))

# for i in range(1, num + 1):
#     if num % i == 0: 
#         print(i) 

""" დაწერეთ პროგრამა, რომელიც მომხარებელს შემოატანინებს რიცხვს დa  დაბეჭდავს ეს რიცხვი
 დადებითია, უარყოფითია თუ 0-ია"""

# num = int(input("გთხოვთ შეიტანოთ რიცხვი: "))

# if num > 0:
#     print("ეს რიცხვი დადებითია.")
# elif num < 0:
#     print("ეს რიცხვი უარყოფითია.")
# else:
#     print("ეს რიცხვი არის 0.")

"""დაწერეთ პროგრამა, რომელიც მომხარებელს შემოატანინებს წელს და გაიგებს არის თუ არა 
ის ნაკიანი(წელი როდესაც თებერვალში 29 დღე გვაქვს). ნაკიანი არის წელი თუ ის იყოფა 4-ზე
 და არ იყოფა 100-ზე ან იყოფა 400-ზე.(გამოიყენეთ and და or ოპერატორები)"""

# year = int(input("გთხოვთ, შეიტანოთ წელი: "))

# if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
#     print(f"{year} არის ნაკიანი წელი.")
# else:
#     print(f"{year} არ არის ნაკიანი წელი.")


"""მომხმარებელს შემოატანინეთ რიცხვი 1-დან 100-ის ჩათვლით(ეს იქნება მისი ქულა). 
თუ მაგალითად 90-დან 100-ის ჩათვლით ექნება ქულა გამოუტანეთ "Your grade is A",
 თუ 80-დან 90-მდე, გამოუტანეთ "Your grade is B", თუ 70-დან 80-მდე გამოუტანეთ 
 "Your grade is C", სხვა შემთხვევაში გამოუტანეთ "Your grade is D" """

# score = int(input("გთხოვთ, შეიტანოთ თქვენი ქულა (1-დან 100-მდე): "))

# if 90 <= score <= 100:
#     print("Your grade is A")
# elif 80 <= score < 90:
#     print("Your grade is B")
# elif 70 <= score < 80:
#     print("Your grade is C")
# else:
#     print("Your grade is D")

