"""შექმენით string-ების სია, გადაუარეთ მას for loop-ით და დაბეჭდეთ სიაში არსებული 
ყველა სიტყვის სიმბოლოთა რაოდენობა"""

# words = ["გამარჯობა", "მსოფლიო", "პროგრამირება", "ცხოვრება", "ცა"]
# for word in words:
#     print(f"სიტყვა: {word}, სიმბოლოთა რაოდენობა: {len(word)}")


"""შექმენით რიცხვების სია, while loop-ის გამოყენებით გაიგეთ ამ სიაში ყველა ლუწი 
რიცხვის ჯამი და დაპრინტეთ"""

# numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# even_sum = 0

# i = 0
# while i < len(numbers):
#     if numbers[i] % 2 == 0: 
#         even_sum += numbers[i]  
#     i += 1

# print(f"ლუწი რიცხვების ჯამი: {even_sum}")


"""შექმენით სახელების სია, გადაუარეთ მას for loop-ით და დაბეჭდეთ ამ სიიდან მხოლოდ ის
 სახელები, რომლებიც იწყებიან "A"-ზე"""

# names = ["Alice", "Bob", "Anna", "Charlie", "Alex", "David", "Amanda"]

# for name in names:
 
#     if name.startswith("A"):
#         print(name)


"""შექმენით რიცხვების სია, სადაც გექნებათ დუბლიკატები. გადაუარეთ მას for loop-ით და 
დაბეჭდეთ მხოლოდ ისეთი რცხვების ჯამი, რომლებიც არ მეორდება სიაში"""

# numbers = [1, 2, 3, 4, 2, 3, 5, 6, 5, 7, 8, 9, 9]

# unique_sum = 0

# for number in numbers:
#     if numbers.count(number) == 1:  
#         unique_sum += number

# print(f"რიცხვების ჯამი, რომლებიც არ მეორდება: {unique_sum}")


"""შექმენით პროგრამა, რომელიც მომხარებელს შემოატანინებს რიცხვს და დაბეჭდავს 1-დან
 შემოტანილ რიცხვამდე ყველა მარტივ რიცხვს"""


# n = int(input("შეიტანეთ რიცხვი: "))
# print(f"1-დან {n}-მდე მარტივი რიცხვები არიან:")
# for num in range(2, n + 1):
#     is_prime = True
#     for i in range(2, num):
#         if num % i == 0:
#             is_prime = False
#             break
#     if is_prime:
#         print(num)


""" შექმენით სია შემდგარი 5 ელემენტისგან. slicing-ის გამოყენებით დაბეჭდეთ მე-3 და
 მე-4 ელემენტები"""

# my_list = [10, 20, 30, 40, 50]
# print(my_list[2:4])  

""" შექმენით რიცხვების სია, შემდგარი 10 ელემენტისგან. slicing-ის გამოყენებით დაბეჭდეთ სიის ყოველი მეორე ელემენტი
"""

# my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# print(my_list[::2])  

""" შექმენით ცვლადი, სადაც შეინახავთ string-ს. დაბეჭდეთ სთრინგის ბოლო სამი 
სიმბოლო(გამოიყენეთ slicing და მინუსიანი ინდექსები) """

# my_string = "Hello, World!"
# print(my_string[-3:])  

""" შექმენით რიცხვების სია, დაბეჭდეთ სია თავიდან ბოლომდე slicing-ის გამოყენებით"""

# my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# print(my_list[:])  















































































