## კომენტარებით აღწერე ცვლადის შექმნის თითოეული ნაბიჯი (სულ3)
""" ვქმნით ცვლადს რომელშიც ვინაცავთ რაღაც ნიშვნელობას ანუ ცვლადს ვარქმევტ სახელს უმჯობესი იქნება
 თუ სახელს ცვლლადში შენახული მნიშვნელობას ემთხვეოდეს მაგალითად: name = "nino" _ აქ შევქმენი ცვლადი 
 სახელად name  და მივანიჭე მას მნიშვნელობა ნინო ანუ გოგოს სახელი (აქ ვისი სახელიც გინდათ იმის ჩაწერეთ არ
   აქვს მნიშვნელობა დდ)"""

## შექმენი სამი ცვლადი num1, num2,  და num3, შემდეგ კი დარინტეთ მათი ჯამი 
###1
# num1 = 10
# num2 = 20
# num3 = 30
# print(num1 + num2 + num3)

###2
# num1 = 10
# num2 = 20
# num3 = 30
# sum = num1 + num2 + num3 
# print( sum )

"""შექმენით ორი ცვლადი X, Y და დაპრინტეთ მათი ნამრავლი""" 

###1
# x = 5
# y = 10
# print(x * y)

###2 
# x = 5
# y = 10
# multiplied = x * y
# print(multiplied)


"""მართკუთხედის პერიმეტრი: შექმენით ორი ცვლადი length და width(მართკუთხედის გვერდები), მიანიჭეთ მნიშვნელობებად 20 
და 10. გამოითვალეთ მართკუთხედის პერიმეტრი და დაპრინტეთ."""

# lenght = 20
# width = 10 
# sum = lenght + width 
# print( 2 * sum)



"""შექმენით სამი ცვლადი age1, age2, age3, სადაც შეინახავთ თქვენი და ოჯახის წევრების ასაკს. გაიგეთ ცვლადებში
 შენახული მნიშვნელობების საშუალო არითმეტიკული და დაპრინტეთ."""

# age1 = 15
# age2 = 17
# age3 = 37
# age4 = 40
# sum = age1 + age2 + age3 + age4
# print(sum // 4)


"""შექმენით ორი ცვლადი, პირველში შეინახეთ თქვენი სახელი, მეორეში გვარი. მოახდინეთ კონკადინაცია(რესურსებში არის 
ჩაგდებული და გადახედეთ) ამ ორ ცვლადს შორის და პასუხი შეინახეთ ახალ ცვლადში სახელად result. დაბეჭდეთ result ცვლადი."""


# name = "nino"
# lastname = "khvichia"
# result = name + " " + lastname
# print(result)

""" შექმენით ორი ცვლადი age და fullname, პირველში შეინახეთ თქვენი ასაკი, ხოლო მეორეში სრული სახელი(სახელი და გვარი).
 დაბეჭდეთ fullname ცვლადში შენახული მნიშვნელობა იმდენჯერ, რამდენი წლისაც ხართ(გამოიყენე შექმნილი age ცვლადი). 
 დაბეჭდე ერთი print()-ფუნქციის მეშვეობით"""

# age = 15
# fullname = "nino khvichia"
# print((fullname , ) * age) 












