""" შექმენით ორი ცვლადი. პირველი ცვლადის სახელი იყოს num1, ხოლო მეორე ცვლადის 
num2. გამოიყენეთ print() ფუნქცია 4-ჯერ. ცვლადში შენახული მნიშვნელობების შორის
 გააკეთეთ მათემატიკური ოპერაციები(+,-,/,*)"""

# num1 = 10
# num2 = 5

# print(num1 + num2)  
# print(num1 - num2) 
# print(num1 * num2)
# print(num1 / num2) 


""" დაბეჭდეთ თქვენი სახელი 10-ჯერ print() ფუნქციის გამოყენებით. შემდეგ კი შეცვალეთ
 თითოეულ პრინტში სახელი"""

# print("ნინო")
# print("ნინო")
# print("ნინო")
# print("ნინო")
# print("ნინო")
# print("ნინო")
# print("ნინო")
# print("ნინო")
# print("ნინო")
# print("ნინო")


# print("მარიამი")
# print("გიორგი")
# print("ანა")
# print("ზურაბი")
# print("ეკატერინე")
# print("თომა")
# print("ირაკლი")
# print("სალომე")
# print("ლევანი")
# print("ლიზა")

