"""გამოიტანეთ თქვენი სახელი და გვარი იმდენჯერ, რამდენი წლისაც ხართ"""

# first_name = input("შეიტანეთ თქვენი სახელი: ")
# last_name = input("შეიტანეთ თქვენი გვარი: ")
# age = int(input("შეიტანეთ თქვენი ასაკი: "))

# for _ in range(age):
#     print(first_name, last_name)


"""გამოიტანეთ ტერმინალში რიცხვები 1-დან 20-ის ჩათვლით"""

# for number in range(1, 21):
#     print(number)

"""გამოიტანეთ ტერმინალში რიცხვები 20-დან 0-მდე"""

# for number in range(20, -1):
#     print(number)

"""გამოითვალეთ 1-დან 50-ის ჩათვლით ყველა რიცხვის ჯამი და დაპრინტეთ საბოლოო შედეგი"""

# total_sum = 0

# for i in range(1, 51):
#     total_sum += i

# print(total_sum)

"""დაბეჭდეთ 1-დან 5-ის ჩათვლით რიცხვთა კვადრატი(n * n)"""

# for n in range(1, 6):
#     print(n * n)

"""დაბეჭდეთ ყველა ლუწი რიცხვის ჯამი 1-დან 10-ის ჩათვლით"""

# total_sum = 0

# for n in range(1, 11):
#     if n % 2 == 0: 
#         total_sum += n

# print(total_sum)

"""მომხარებელს შემოატანინეთ რიცხვი და შეინახეთ ცვლადში, შემდეგ კი 0-დან შემოტანილი 
რიცხვის ჩათვლით შეამოწმეთ, თუ ლუწია დაბეჭდეთ რიცხვი is Even, სხვა შემთხვევაში 
რიცხვი is Odd;(მაგალითად 4, ლუწია ამიტომაც დაბეჭდავთ "4 is Even")"""

# num = int(input("გთხოვთ შეიტანოთ რიცხვი: "))

# for i in range(1):
#     if num % 2 == 0:
#        print(f"{num} is Even")
#     else:
#        print(f"{num} is Odd")





















































