"""თქვენი სიტყვებით ახსენით რა არის html-ის ელემენტები, თეგები, გამხსნელი თეგი, 
დამხურავი თეგი, კონტეინერ თეგი და ცარიელი თეგი"""
 


"""HTML თეგი წარმოადგენს სპეციალურ სიმბოლოს, რომელიც აღნიშნავს ვებ-გვერდის ელემენტს. 
თეგები ხსნიან და დახურავენ კონკრეტულ ელემენტს. თითოეული თეგი მდებარეობს კუთხური
 ფრჩხილებში, მაგალითად:
<p>ეს არის პარაგრაფი</p>
აქ <p> არის გამხსნელი თეგი, ხოლო </p> არის დამხურავი თეგი


 
გამხსნელი თეგი აღნიშნავს, რომ ელემენტი იწყება. ის ყოველთვის წერია კუთხური
 ფრჩხილების შიგნით, მაგალითად:
<h1>ვებ-გვერდის სათაური</h1>
აქ <h1> არის გამხსნელი თეგი, რომელიც აღნიშნავს, რომ ეს ელემენტი არის სათაური.


დამხურავი თეგი წარმოადგენს იმას, რომ ელემენტი მთავრდება. ის ძალიან ჰგავს გამხსნელ
 თეგს, მაგრამ აქვს დამატებითი ხალხები (/) შემდეგ კუთხური ფრჩხილის:
<p>ეს არის ტექსტი</p>
აქ </p> არის დამხურავი თეგი.



კონტეინერ თეგი არის HTML ელემენტი, რომელიც მოიცავს შიგნით სხვა ელემენტებს ან შინაარსს.
 ასეთი ელემენტები ყოველთვის შედგება როგორც გამხსნელი, ისე დამხურავი თეგისგან.
  მაგალითად, <div> ან <ul> (ეროვნული სია):
<div>
  <h2>სათაური</h2>
  <p>ტექსტი</p>
</div>
აქ <div> არის კონტეინერ თეგი, რომელიც შეიცავს შიდა ელემენტებს — <h2> და <p>.




ცარიელი თეგი არ საჭიროებს დამხურველ თეგს, რადგან მას არ გააჩნია შიგნით შინაარსი. 
ასეთი თეგები ხშირად გამოიყენება მედიის ან ფუნქციონალობის დასამატებლად, მაგალითად
 <img> სურათისთვის ან <br> წინასავტომობილოდ ხაზის გასაშვებად:
<img src="image.jpg" alt="სურათი">
<br>
აქ <img> და <br> ცარიელი თეგებია, რადგან ისინი არ მოიცავენ შიგნით შინაარსს. """









































