"""შექმენით პროგრამა while ციკლის საშვალებით რომელიც გამოთვლის ყველა ნატურალური 
რიცხვის ჯამს 1-იდან 50-მდე"""

# total_sum = 0
# n = 1
# while n <= 50:
#     total_sum += n  
#     n += 1  
# print( total_sum)

"""შექმენით პროგრამა რომელიც მომხმარებელს შეეკითხება pin კოდს (4 ციფრიანი კოდი) 
მანამდე სანამ არ შეიყვანს 1234-ს"""

# correct_pin = "1234"

# while True:
#     pin = input("გთხოვთ შეიტანოთ თქვენი PIN კოდი (4 ციფრიანი): ")
    
#     if pin == correct_pin:
#         print("PIN კოდი სწორია.")
#         break 
#     else:
#         print("არასწორი PIN კოდი. გთხოვთ სცადოთ თავიდან.")


"""შექმნით რიცხვის გამოცნობის თამაში while ციკლით, რომელიც მომხმარებელს შეეკითხება
 რიცხვს 1-დან 10-მდე, სანამ მომხმარებელი არ შეიყვანს თქვენთვის სასურველ რიცხვს"""


# target_number = 4

# while True:
#     guess = int(input("გთხოვთ გამოიცნოთ რიცხვი 1-დან 10-მდე: "))
    
#     if guess == target_number:
#         print(f"მშვენიერი! თქვენ გამოიცნეთ სწორი რიცხვი: {target_number}")
#         break  
#     else:
#         print("არასწორი რიცხვი. სცადეთ ისევ.")
































