"""while ციკლის საშვალებით გამოიტანეთ რიცხვები 20-იდან 0-მდე"""
# num = 20

# while num >= 0:
#     print(num)  
#     num -= 1  

"""while ციკლის საშვალებით გამოიტანეთ 1-დან 20-მდე მხოლოდ ლუწი რიცხვები"""

# num = 1

# while num <= 20:
#     if num % 2 == 0:  
#         print(num) 
#     num += 1  

"""while ციკლის საშვალებით გამოიტანეთ 1-იდან 100-მდე ყველა 5-ის ჯერადი რიცხვი"""

# num = 1

# while num <= 100:
#     if num % 5 == 0: 
#         print(num) 
#     num += 1  

"""while ციკლისა და input-ის საშვალებით მომხარებელს შემოატანინეთ პაროლი სანამ 
არ იქნება ის "goa123"-ის ტოლი"""

# password = ""

# while password != "goa123":
#     password = input("შეიტანეთ პაროლი: ")

# print("პაროლი სწორია!")



