"""Bug (ბაგი) ნიშნავს პროგრამაში ან სისტემაში არსებული შეცდომას, ხარვეზს ან გაუმართაობას, რომელიც ართულებს პროგრამის ან აპლიკაციის სწორ ფუნქციონირებას.
Debugging (დეპურინგი) არის პროცესი, რომლის მიზანია ბაგების აღმოჩენა, ანალიზი და ამოცნობა, რათა პროგრამა სწორად ფუნქციონირებდეს.
"""

""")გააკეთეთ ხუთ ხუთი მაგალითი ყველა განვლილ მათემატიკურ ოპერატორზე."""
#თითო თითო ეყოფა :)) 
# print(10+10)
# print(10-10)
# print(10*10)
# print(10/10)


"""შექმენით ცვლადები და შიგნით შეინახეთ თქვენი ოჯახის წევრების ასაკები, საბოლოოდ დაბეჭდეთ ყველა ასაკის ჯამი"""
# mum_age = 37
# brother_age = 17
# my_age =15
# sum_age = mum_age + brother_age + my_age 
# print(sum_age)

"""კომენტარებით აღწერეთ, რა არის დროებითი მეხსიერება და რისთვის გვჭირდება ის."""

# დროებითი მეხსიერება (ინგლისურად "temporary memory" ან "volatile memory") წარმოადგენს ტიპის მეხსიერებას,
#  რომელიც ინახავს მონაცემებს მხოლოდ მაშინ, როდესაც მოწყობილობა მუშაობს. როგორც კი მოწყობილობა გამორთულია,
#    ყველა ინფორმაცია კარგდება.






