"""for ციკლით მომხარებელს შემოატანინეთ 5 ელემენტი სიაში და დაბეჭდეთ სია"""

# my_list = []

# for i in range(5):
#     element = input(f"შეიტანეთ {i+1}-ე ელემენტი: ")
#     my_list.append(element)  

# print("ჩამონათვალია:", my_list)


"""შექმენით ხილების სია, სადაც გექნებათ მინიმუმ 3 ელემენტი. მომხარებელს შემოატანინეთ
თავისი საყვარელი ხილი, თუ სიის ბოლო ელემენტის ინდექსი არის ლუწი ჩაამატეთ შემოტანილი
ხილი სიაში, სხვა შემთხვევაში არ ჩაამატოთ """

# fruits = ["ფორთოხალი", "ბანანი", "ვაშლი"]

# favorite_fruit = input("შეიტანეთ თქვენი საყვარელი ხილი: ")

# if len(fruits) % 2 == 1:
#     fruits.append(favorite_fruit)
#     print("ხილი დაემატა.")
# else:
#     print("ხილი არ დაემატა.")

# print(fruits)

""" შექმენით სია შემდგარი სახელებისგან. მომხარებელს შემოატანინეთ მისი სახელი, 
თუ მისი სახელი იქნება 5 სიმბოლოს ტოლი ან მეტი. ჩაამატეთ სიაში, სხვა შემთხვევაში 
დაუბეჭდეთ "Name is too short" """

# names = []

# name = input("შეიტანეთ თქვენი სახელი: ")

# if len(name) >= 5:
#     names.append(name)  
# else:
#     print("Name is too short")

# print("სიაში სახეები:", names)

"""შექმენით სია შემდგარი 10 ელემენტისგან. დაპრინტეთ ის და მომხარებელს შემოატანინეთ
 რიცხვი 1-დან 10-ჩათვლით. შემდეგ წაშალეთ სიის ის ელემენტი რომელი რიცხვიც გადმოგეცათ
   და დაპრინტეთ განახლებული სია"""

# my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# print("ორიგინალური სია:", my_list)

# index = int(input("შეიტანეთ რიცხვი 1-დან 10-ჩათვლით: ")) - 1  
# if 0 <= index < len(my_list):
#     my_list.pop(index)
#     print("განახლებული სია:", my_list)
# else:
#     print("არასწორი რიცხვი.")

""""""
























































































